In [2]:
dict = {'Name':['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal', 'Archana'],
       'Marks':[98,89,99,87,90,83,99],
       'Gender':['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female']
       }
dict

{'Name': ['Priyang',
  'Aadhya',
  'Krisha',
  'Vedant',
  'Parshv',
  'Mittal',
  'Archana'],
 'Marks': [98, 89, 99, 87, 90, 83, 99],
 'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female']}

# 1. Converting dictionary into dataframe

In [3]:
import pandas as pd

df = pd.DataFrame(dict)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 2. Displaying top THREE rows

In [4]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 3. Displaying Bottom THREE rows

In [5]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 4. Determine the shape of the dataset (Number of rows and columns)

In [29]:
print('The number of rows is:',df.shape[0],' and the number of columns is:',df.shape[1])

The number of rows is: 7  and the number of columns is: 3

# 5. Get info like total number of rows, total columns, datatypes, memory requirement

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# 6. Check null values in the dataset

In [31]:
print('The dataset has',df.isnull().sum().sum(),'null values')

The dataset has 0 null values

# 7. Get overall statistics of the dataframe

In [33]:
#It describes statistics for numberical columns only
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [34]:
#If we want statistics for all the columns, then we have to add an additional argument to the code.
df.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 8. Find unique values from the gender column

In [35]:
uni = df['Gender'].unique()
print('The unique values from the Gender column are',uni[0],'and',uni[1])

The unique values from the Gender column are Male and Female

# 9. Find number of unique values from the gender column

In [24]:
df['Gender'].nunique()

2

# 10. Display the count of unique values in Gender column

In [39]:
df22 = pd.DataFrame(df['Gender'].value_counts())
df22

        count
Gender
Female      4
Male        3

# 11. Find total number of students having marks between 90 and 100 (inclusive) using between method

In [50]:
df[(df['Marks']>=90) & (df['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [49]:
#Without using between method
print('The total number of students having marks between 90 and 100 is', len(df[(df['Marks']>=90) & (df['Marks']<=100)]))

The total number of students having marks between 90 and 100 is 4

In [52]:
#By using between method
sum(df['Marks'].between(90,100))

4

In [53]:
print('The total number of students having marks between 90 and 100 is', sum(df['Marks'].between(90,100)))

The total number of students having marks between 90 and 100 is 4

# 12. Find average marks

In [57]:
round(df['Marks'].mean(),2)

92.14

# 13. Apply Method

In [61]:
#Let us create our own function and use it on pandas dataframe by using apply method

def half(x):
    return x/2

df['Half_Marks'] = df['Marks'].apply(half)
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

# 14. Map function

In [64]:
df["Male_Female"] = df['Gender'].map({'Male':1, 'Female':0})
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

# 15. Drop Column(s)

In [67]:
df.drop('Male_Female',axis = 1)
#For dropping multiple columns, put those columns in a python list. e.g
#df.drop(['Male_Female','Half_Marks'],axis = 1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

# 16. Print the name of columns

In [69]:
df.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')

 # 17. Sort the dataframe as per the marks column

In [70]:
#Ascending order
df.sort_values(by = 'Marks')

      Name  Marks  Gender  Half_Marks  Male_Female
5   Mittal     83  Female        41.5            0
3   Vedant     87    Male        43.5            1
1   Aadhya     89  Female        44.5            0
4   Parshv     90    Male        45.0            1
0  Priyang     98    Male        49.0            1
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0

In [71]:
#Descending order
df.sort_values(by = 'Marks' , ascending = False)

      Name  Marks  Gender  Half_Marks  Male_Female
2   Krisha     99  Female        49.5            0
6  Archana     99  Female        49.5            0
0  Priyang     98    Male        49.0            1
4   Parshv     90    Male        45.0            1
1   Aadhya     89  Female        44.5            0
3   Vedant     87    Male        43.5            1
5   Mittal     83  Female        41.5            0

# 18. Display the names and marks of the female students

In [84]:
df[df['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [88]:
#Another way of doing it is using isin method, which takes a list as its argument.
df[df['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99